app/controllers/friendships_controller.rb

  def destroy
    @friendship = current_user.friendships.where(friend_id: params[:id]).first
    @friendship.destroy
---
SELECT  "friendships".* FROM "friendships"  WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = 2  ORDER BY "friendships"."id" ASC LIMIT 1  [["user_id", 3]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 2]]