app/controllers/user_stocks_controller.rb

SELECT  "stocks".* FROM "stocks"  WHERE "stocks"."ticker" = 'GOOG' LIMIT 1
INSERT INTO "stocks" ("created_at", "last_price", "name", "ticker", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2018-09-10 16:03:38.155667"], ["last_price", 1166.15], ["name", "Alphabet Inc."], ["ticker", "GOOG"], ["updated_at", "2018-09-10 16:03:38.155667"]]
---
  def create
    stock = Stock.find_by_ticker(params[:stock_ticker])
    if stock.blank?
      stock = Stock.new_from_lookup(params[:stock_ticker])
      stock.save
    end
    @user_stock = UserStock.create(user: current_user, stock: stock)

SELECT  "user_stocks".* FROM "user_stocks"  WHERE "user_stocks"."user_id" = 1 AND "user_stocks"."stock_id" = 1  ORDER BY "user_stocks"."id" ASC LIMIT 1
DELETE FROM "user_stocks" WHERE "user_stocks"."id" = ?  [["id", 1]]
---
  def destroy
    stock = Stock.find(params[:id])
    @user_stock = UserStock.where(user_id: current_user.id, stock_id: stock.id).first
    @user_stock.destroy