app/controllers/users_controller.rb

SELECT "users".* FROM "users"  WHERE (first_name like '%hi%')
---
  def search
    if params[:search_param].blank?
      flash.now[:danger] = 'Empty search string.'
    else
      @users = User.search(params[:search_param])

SELECT  "users".* FROM "users"  WHERE "users"."id" = 3  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "friendships" ("created_at", "friend_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2018-09-12 15:24:43.727239"], ["friend_id", 2], ["updated_at", "2018-09-12 15:24:43.727239"], ["user_id", 3]]
---
  def add_friend
    @friend = User.find(params[:friend])
    current_user.friendships.build(friend_id: @friend.id)

    if current_user.save